experiment/results/no_istio_20260105_144228/wrk_logs/wrk_500rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 10.158ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 10.302ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 9.825ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 8.719ms, rate sampling interval: 43ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.64ms   15.74ms  45.31ms   89.87%
    Req/Sec   125.50     53.27   261.00     67.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.17ms
 75.000%   17.45ms
 90.000%   26.51ms
 99.000%   45.31ms
 99.900%  230.91ms
 99.990%  308.99ms
 99.999%  321.28ms
100.000%  329.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.603     0.000000            1         1.00
       1.802     0.100000         5499         1.11
       2.095     0.200000        10988         1.25
       2.521     0.300000        16452         1.43
       3.437     0.400000        21933         1.67
       4.171     0.500000        27412         2.00
       4.591     0.550000        30160         2.22
       5.235     0.600000        32889         2.50
       7.135     0.650000        35625         2.86
      15.103     0.700000        38365         3.33
      17.455     0.750000        41120         4.00
      18.591     0.775000        42486         4.44
      19.743     0.800000        43852         5.00
      21.103     0.825000        45230         5.71
      22.623     0.850000        46590         6.67
      24.463     0.875000        47963         8.00
      25.455     0.887500        48649         8.89
      26.511     0.900000        49327        10.00
      27.727     0.912500        50016        11.43
      29.103     0.925000        50696        13.33
      30.591     0.937500        51386        16.00
      31.423     0.943750        51728        17.78
      32.463     0.950000        52066        20.00
      33.535     0.956250        52415        22.86
      34.655     0.962500        52759        26.67
      35.999     0.968750        53097        32.00
      36.895     0.971875        53267        35.56
      37.791     0.975000        53443        40.00
      38.751     0.978125        53609        45.71
      39.903     0.981250        53783        53.33
      41.631     0.984375        53950        64.00
      42.591     0.985938        54038        71.11
      43.359     0.987500        54121        80.00
      44.639     0.989062        54211        91.43
      46.239     0.990625        54294       106.67
      48.799     0.992188        54378       128.00
      50.975     0.992969        54422       142.22
      54.591     0.993750        54464       160.00
      61.631     0.994531        54507       182.86
      71.935     0.995313        54550       213.33
      88.319     0.996094        54592       256.00
     105.471     0.996484        54614       284.44
     118.847     0.996875        54635       320.00
     136.447     0.997266        54657       365.71
     141.823     0.997656        54678       426.67
     161.407     0.998047        54700       512.00
     183.423     0.998242        54710       568.89
     193.791     0.998437        54721       640.00
     209.023     0.998633        54732       731.43
     223.231     0.998828        54742       853.33
     233.983     0.999023        54753      1024.00
     246.399     0.999121        54758      1137.78
     250.239     0.999219        54764      1280.00
     253.951     0.999316        54769      1462.86
     260.095     0.999414        54774      1706.67
     268.799     0.999512        54780      2048.00
     273.407     0.999561        54782      2275.56
     277.247     0.999609        54785      2560.00
     280.831     0.999658        54788      2925.71
     283.647     0.999707        54790      3413.33
     293.887     0.999756        54793      4096.00
     297.215     0.999780        54794      4551.11
     299.263     0.999805        54796      5120.00
     300.031     0.999829        54797      5851.43
     300.287     0.999854        54798      6826.67
     308.479     0.999878        54800      8192.00
     308.479     0.999890        54800      9102.22
     308.991     0.999902        54801     10240.00
     310.783     0.999915        54802     11702.86
     310.783     0.999927        54802     13653.33
     316.671     0.999939        54803     16384.00
     316.671     0.999945        54803     18204.44
     321.023     0.999951        54804     20480.00
     321.023     0.999957        54804     23405.71
     321.023     0.999963        54804     27306.67
     321.279     0.999969        54805     32768.00
     321.279     0.999973        54805     36408.89
     321.279     0.999976        54805     40960.00
     321.279     0.999979        54805     46811.43
     321.279     0.999982        54805     54613.33
     329.471     0.999985        54806     65536.00
     329.471     1.000000        54806          inf
#[Mean    =       10.639, StdDeviation   =       15.738]
#[Max     =      329.216, Total count    =        54806]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59790 requests in 2.00m, 54.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:    498.21  
Transfer/sec:    467.49KB